УправДом/src/Documents/УстановкаЦенКомунальныхУслуг/УстановкаЦенКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенКомунальныхУслуг</name>
  <registerRecords>InformationRegister.ЦеныКомунальныхУслуг</registerRecords>
  <attributes>
    <name>МесяцНачалаДействия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЦен</name>
    <attributes>
      <name>ВидПлатежа</name>
      <type>
        <types>CatalogRef.ВидыПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/ЦеныКомунальныхУслуг/ЦеныКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКомунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачалаДейсвия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/УстановкаЦенКомунальныхУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	

	// регистр ЦеныКомунальныхУслуг
	Движения.ЦеныКомунальныхУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаСписокЦен Из СписокЦен Цикл
		Движение = Движения.ЦеныКомунальныхУслуг.Добавить();
		Движение.Период = Дата;
		Движение.ВидПлатежа = ТекСтрокаСписокЦен.ВидПлатежа;
		Движение.МесяцНачалаДейсвия = МесяцНачалаДействия;
		Движение.Цена = ТекСтрокаСписокЦен.Цена;
		Движение.КодМесяца = Число(МесяцНачалаДействия.Код);
	КонецЦикла;

КонецПроцедуры
